Wassertank_Mesh2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       2700;
    }
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       3100;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       3200;
    }
)

// ************************************************************************* //
